# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя,
# а указать явно, в программе.
my_list = [1, 2.2, 'str', [1, 'str'], {'key': 'value'}, {"a", "b"}, True, (5, 'el')]

for el in my_list:
    print(type(el))
