# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

# my_list = (input('введите строку из нескольких слов: ')).split()
my_list = 'это тестовая строка 01234567891011'.split()
# print(my_list)
for idx, el in enumerate(my_list):
    el = el[0:10]
    print(idx, el)
