# *Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
# Каждый кортеж хранит информацию об отдельном товаре. В кортеже должно быть два элемента —
# номер товара и словарь с параметрами (характеристиками товара: название, цена, количество,
# единица измерения). Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
# Пример готовой структуры:
# [
#     (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
#    (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
#    (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]
# Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара,
# например название, а значение — список значений-характеристик, например список названий товаров.
# Пример:
# {
#     “название”: [“компьютер”, “принтер”, “сканер”],
#    “цена”: [20000, 6000, 2000],
#    “количество”: [5, 2, 7],
#   “ед”: [“шт.”]
# }

goods = [
    (1, {"название": "компьютер", "цена": 20000, "количество": 5, "eд": "шт."}),
    (2, {"название": "принтер", "цена": 6000, "количество": 2, "eд": "шт."}),
    (3, {"название": "сканер", "цена": 2000, "количество": 7, "eд": "шт."})
]
# goods = []
# i = 0
# while True:
#     passport = input('для ввода данных нажмите "y": ')
#     if passport.upper() == "Y":
#         name = input('Введите название товара: ')
#         price = input('Введите цену товара: ')
#         count = input('Введите количество товара: ')
#         unit = input('Введите единицы товара: ')
#         element = {'название': name, 'цена': price, 'количество': count, 'ед': unit}
#         goods.append((i + 1, element))
#         i += 1
#     else:
#         break

# Это был первый вариант. Недостаток лишний цикл и как следствие потребление ресурсов
# analysis = {}
# for good in goods:
#     for el in good:
#         if str(type(el)) == '<class \'dict\'>':
#             for key, value in el.items():
#                 if analysis.get(key) is not None:
#                     analysis[key].append(value)
#                 else:
#                     analysis[key] = [value]
# print(analysis)

# Второй вариант
analysis = {}
for good in goods:
    for key, value in good[1].items():
        if analysis.get(key) is not None:
            analysis[key].append(value)
        else:
            analysis[key] = [value]
print(analysis)
