# 2. Пользователь вводит время в секундах.
# Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.

# sec = int(input('введите время в секундах: '))
sec = int('1125314')

time_sec = sec % 60
minutes = sec // 60
time_min = minutes % 60
time_hours = minutes // 60
print(f'{time_hours}:{time_min}:{time_sec}')

# при некоторых значениях может получаться не красивый вывод: ч:м:с
