# 6) Спортсмен занимается ежедневными пробежками.В первый день его результат составил a километров.
#    Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
#    Требуется определить номер дня, на который результат спортсмена составит не менее b километров.
#    Программа должна принимать значения параметров a и b и выводить одно натуральное число —​номер дня.
#    Например: a = 2, b = 3.
#    Результат:
#    1-й день: 2
#    2-й день: 2,2
#    3-й день: 2,42
#    4-й день: 2,66
#    5-й день: 2,93
#    6-й день: 3,22
#     Ответ: на 6-й день спортсмен достиг результата ​ —​ не менее 3 км.

# result = int(input('Введите результат первого дня: '))
# result_last_day = int(input('Введите требуемый результат: '))

result = int('2')
result_last_day = int('3')

day = 0
while result < result_last_day:
    day += 1
    if day != 1:
        result = result + result / 10
    print(f'{day}-й день: {result:.2f}')

print(f'Ответ: на {day}-й день спортсмен достиг результата - не менее {result:.0f} км.')
# Задание решал около часа, не сразу догадался как вывести в цикле последний день
